from myapp.models import AyurvedicMedicine

def populate_medicines():
    ayurvedic_medicines = [
        # {
        #         "name": "ത്രിഫല",
        #         "description": "അമലാകി, ബിഭിതകി, ഹരിതകി എന്നീ മൂന്ന് പഴങ്ങളുടെ സംയോജനമാണ് ത്രിഫല. ഇത് ആൻ്റിഓക്‌സിഡൻ്റ് ഗുണങ്ങൾക്ക് പേരുകേട്ടതാണ്, ദഹന ആരോഗ്യം പ്രോത്സാഹിപ്പിക്കുന്നതിനും പ്രതിരോധശേഷി മെച്ചപ്പെടുത്തുന്നതിനും വിഷാംശം ഇല്ലാതാക്കുന്നതിനും ഇത് ഉപയോഗിക്കുന്നു.",
        #         "treats": "മലബന്ധം, ദഹനക്കേട്, വിഷാംശം ഇല്ലാതാക്കൽ"
        #     },
        #     {
        #         "name": "മഞ്ഞൾ",
        #         "description": "മഞ്ഞൾ, അല്ലെങ്കിൽ കുർക്കുമ ലോംഗ, ശക്തമായ ആൻറി-ഇൻഫ്ലമേറ്ററി, ആൻ്റിഓക്‌സിഡൻ്റ് ഗുണങ്ങളുള്ള ഒരു സുഗന്ധവ്യഞ്ജനമാണ്. സംയുക്ത ആരോഗ്യത്തെ പിന്തുണയ്ക്കുന്നതിനും ദഹനം മെച്ചപ്പെടുത്തുന്നതിനും ചർമ്മത്തിന് തിളക്കം നൽകുന്നതിനും ആയുർവേദത്തിൽ ഇത് സാധാരണയായി ഉപയോഗിക്കുന്നു.",
        #         "treats": "വീക്കം, സന്ധി വേദന, ദഹന പ്രശ്നങ്ങൾ"
        #     },
        #     {
        #         "name": "വേപ്പ്",
        #         "description": "ആൻറി ബാക്ടീരിയൽ, ആൻറിവൈറൽ, ആൻറി ഫംഗൽ ഗുണങ്ങളുള്ള ഒരു ഔഷധ സസ്യമാണ് വേപ്പ്, അല്ലെങ്കിൽ അസാദിരാക്റ്റ ഇൻഡിക്ക. വിവിധ ചർമ്മ അവസ്ഥകളെ ചികിത്സിക്കുന്നതിനും വായുടെ ആരോഗ്യം പ്രോത്സാഹിപ്പിക്കുന്നതിനും വിഷാംശം ഇല്ലാതാക്കുന്നതിനും ഇത് ഉപയോഗിക്കുന്നു.",
        #         "treats": "ചർമ്മ അണുബാധകൾ, വാക്കാലുള്ള ശുചിത്വം, വിഷാംശം ഇല്ലാതാക്കൽ"
        #     },
        #     {
        #         "name": "ഗുഗ്ഗുൽ",
        #         "description": "കമ്മിഫോറ മുകുൾ മരത്തിൽ നിന്ന് ലഭിക്കുന്ന ഒരു റെസിൻ ആണ് ഗുഗ്ഗുൾ. കൊളസ്ട്രോൾ കുറയ്ക്കുന്ന ഗുണങ്ങൾക്ക് പേരുകേട്ട ഇത് ഹൃദയാരോഗ്യം, ഭാരം നിയന്ത്രിക്കൽ, തൈറോയ്ഡ് പ്രവർത്തനം എന്നിവയെ പിന്തുണയ്ക്കാൻ ഉപയോഗിക്കുന്നു.",
        #         "treats": "ഉയർന്ന കൊളസ്ട്രോൾ, അമിതവണ്ണം, തൈറോയ്ഡ് തകരാറുകൾ"
        #     },
        #     {
        #         "name": "ബ്രാഹ്മി",
        #         "description": "ബ്രാഹ്മി, അല്ലെങ്കിൽ ബക്കോപ മോന്നിയേരി, വൈജ്ഞാനിക-വർദ്ധിപ്പിക്കുന്ന ഗുണങ്ങൾക്ക് പേരുകേട്ട ഒരു സസ്യമാണ്. മെമ്മറി, ഏകാഗ്രത, മൊത്തത്തിലുള്ള തലച്ചോറിൻ്റെ പ്രവർത്തനം എന്നിവ മെച്ചപ്പെടുത്താൻ ഇത് ഉപയോഗിക്കുന്നു. പിരിമുറുക്കവും ഉത്കണ്ഠയും കുറയ്ക്കാനും ബ്രഹ്മി ഗുണകരമാണ്.",
        #         "treats": "മെമ്മറി നഷ്ടം, മോശം ഏകാഗ്രത, സമ്മർദ്ദം"
        #     },
        #     {
        #         "name": "ത്രികടു",
        #         "description": "ഇഞ്ചി, കുരുമുളക്, നീളമുള്ള കുരുമുളക് എന്നിങ്ങനെ മൂന്ന് ചൂടാക്കൽ സുഗന്ധവ്യഞ്ജനങ്ങളുടെ മിശ്രിതമാണ് ത്രികാതു. ഇത് ദഹനത്തെ സഹായിക്കുന്നു, മെറ്റബോളിസം വർദ്ധിപ്പിക്കുന്നു, ശരീരഭാരം നിയന്ത്രിക്കാൻ സഹായിക്കുന്നു. ശ്വാസകോശാരോഗ്യത്തിനും ത്രികടു ഗുണപ്രദമാണ്.",
        #         "treats": "ദഹനക്കേട്, മെറ്റബോളിസം, ശ്വസന പ്രശ്നങ്ങൾ"
        #     },
        #     {
        #         "name": "ശതാവരി",
        #         "description": "ശതാവരി, അല്ലെങ്കിൽ ശതാവരി റസീമോസസ്, ഹോർമോൺ ബാലൻസിങ് ഗുണങ്ങൾക്ക് പേരുകേട്ട ഒരു പുനരുജ്ജീവന സസ്യമാണ്. ഇത് സ്ത്രീകളുടെ പ്രത്യുത്പാദന ആരോഗ്യത്തെ പിന്തുണയ്ക്കുന്നു, ആർത്തവ അസ്വസ്ഥതകൾ ഒഴിവാക്കുന്നു, മുലയൂട്ടൽ പ്രോത്സാഹിപ്പിക്കുന്നു. ശതാവരിക്ക് ആൻറി-ഇൻഫ്ലമേറ്ററി, ആൻ്റിഓക്‌സിഡൻ്റ് ഇഫക്റ്റുകളും ഉണ്ട്.",
        #         "treats": "ആർത്തവ ക്രമക്കേടുകൾ, ആർത്തവവിരാമ ലക്ഷണങ്ങൾ, മുലയൂട്ടൽ പിന്തുണ"
        #     },
        #     {
        #         "name": "അർജ്ജുനൻ",
        #         "description": "അർജുന, അല്ലെങ്കിൽ ടെർമിനലിയ അർജുന, കാർഡിയോ പ്രൊട്ടക്റ്റീവ് ഗുണങ്ങളുള്ള ഒരു മരത്തിൻ്റെ പുറംതൊലി ആണ്. ഇത് ഹൃദയപേശികളെ ശക്തിപ്പെടുത്തുകയും രക്തചംക്രമണം മെച്ചപ്പെടുത്തുകയും രക്താതിമർദ്ദം നിയന്ത്രിക്കാൻ സഹായിക്കുകയും ചെയ്യുന്നു. ആൻ്റിഓക്‌സിഡൻ്റും ആൻ്റി-ഇൻഫ്ലമേറ്ററി ഇഫക്റ്റുകളും അർജുനനുണ്ട്.",
        #         "treats": "ഹൃദയസംബന്ധമായ പ്രശ്നങ്ങൾ, രക്തസമ്മർദ്ദം, മോശം രക്തചംക്രമണം"
        #     },
        #     {
        #         "name": "ഗുഡൂച്ചി",
        #         "description": "ഗുഡൂച്ചി, അല്ലെങ്കിൽ ടിനോസ്പോറ കോർഡിഫോളിയ, വിഷാംശം ഇല്ലാതാക്കുന്ന ഗുണങ്ങളുള്ള ഒരു പ്രതിരോധശേഷി വർദ്ധിപ്പിക്കുന്ന സസ്യമാണ്. ഇത് പനി നിയന്ത്രിക്കുന്നതിനും പ്രതിരോധശേഷി വർദ്ധിപ്പിക്കുന്നതിനും മൊത്തത്തിലുള്ള ആരോഗ്യവും ഉന്മേഷവും പ്രോത്സാഹിപ്പിക്കുന്നതിനും സഹായിക്കുന്നു.",
        #         "treats": "പനി, കുറഞ്ഞ പ്രതിരോധശേഷി, പൊതു തളർച്ച"
        #     },
        #     {
        #         "name": "ഹരിതകി",
        #         "description": "ത്രിഫലയിലെ മൂന്ന് പഴങ്ങളിൽ ഒന്നാണ് ഹരിതകി അഥവാ ടെർമിനലിയ ചെബുല. പുനരുജ്ജീവിപ്പിക്കുന്നതിനും വിഷാംശം ഇല്ലാതാക്കുന്നതിനും ഇത് അറിയപ്പെടുന്നു. ഹരിതകി ദഹന ആരോഗ്യത്തെ പിന്തുണയ്ക്കുന്നു, കരളിൻ്റെ പ്രവർത്തനം മെച്ചപ്പെടുത്തുന്നു, പ്രതിരോധശേഷി വർദ്ധിപ്പിക്കുന്നു.",
        #         "treats": "ദഹന പ്രശ്നങ്ങൾ, കരൾ തകരാറുകൾ, പ്രതിരോധശേഷി"
        #     },
        #     {
        #         "name": "ശിലാജിത്ത്",
        #         "description": "ഹിമാലയത്തിലെ പാറകളിൽ കാണപ്പെടുന്ന ഒട്ടിപ്പിടിക്കുന്ന വസ്തുവാണ് ശിലാജിത്ത്. ഇതിൽ ഫുൾവിക് ആസിഡും ധാതുക്കളും അടങ്ങിയിട്ടുണ്ട്, ഇത് ശക്തമായ പുനരുജ്ജീവന ടോണിക്ക് ആക്കുന്നു. ശിലാജിത്ത് ഊർജ നിലകൾ വർദ്ധിപ്പിക്കുകയും ചൈതന്യം വർദ്ധിപ്പിക്കുകയും മൊത്തത്തിലുള്ള ആരോഗ്യം പ്രോത്സാഹിപ്പിക്കുകയും ചെയ്യുന്നു.",
        #         "treats": "ക്ഷീണം, ബലഹീനത, കുറഞ്ഞ ഊർജ്ജം"
        #     },
        #     {
        #         "name": "പുനർനവ",
        #         "description": "പുനർനവ, അല്ലെങ്കിൽ ബോർഹാവിയ ഡിഫ്യൂസ, വൃക്കസംബന്ധമായ തകരാറുകൾ, ദ്രാവകം നിലനിർത്തൽ എന്നിവ കൈകാര്യം ചെയ്യാൻ ഉപയോഗിക്കുന്ന ഒരു ഡൈയൂററ്റിക് സസ്യമാണ്. ഇത് വീക്കം കുറയ്ക്കുന്നതിനും മൂത്രത്തിൻ്റെ ഒഴുക്ക് മെച്ചപ്പെടുത്തുന്നതിനും വൃക്കകളുടെ പ്രവർത്തനത്തെ പിന്തുണയ്ക്കുന്നതിനും സഹായിക്കുന്നു. പുനർനവയ്ക്ക് വിരുദ്ധ ബാഹ്യാവിഷ്ക്കാര ഫലങ്ങളും ഉണ്ട്.",
        #         "treats": "എഡിമ, വൃക്കസംബന്ധമായ പ്രശ്നങ്ങൾ, മൂത്രനാളിയിലെ അണുബാധ"
        #     },
        #     {
        #         "name": "അമലാകി",
        #         "description": "ത്രിഫലയിലെ പഴങ്ങളിൽ ഒന്നാണ് അമലാക്കി അഥവാ ഇന്ത്യൻ നെല്ലിക്ക. വിറ്റാമിൻ സി, ആൻ്റിഓക്‌സിഡൻ്റുകൾ എന്നിവയാൽ സമ്പുഷ്ടമാണ്, ഇത് ശക്തമായ പുനരുജ്ജീവന സസ്യമാക്കി മാറ്റുന്നു. അമലക്കി രോഗപ്രതിരോധ പ്രവർത്തനത്തെ പിന്തുണയ്ക്കുന്നു, ദഹനം മെച്ചപ്പെടുത്തുന്നു, ചർമ്മത്തിൻ്റെ ആരോഗ്യം വർദ്ധിപ്പിക്കുന്നു.",
        #         "treats": "ദുർബലമായ പ്രതിരോധശേഷി, ദഹന പ്രശ്നങ്ങൾ, ചർമ്മ പ്രശ്നങ്ങൾ"
        #     },
        #     {
        #         "name": "മുസ്ത",
        #         "description": "മുസ്ത, അല്ലെങ്കിൽ സൈപ്പറസ് റോട്ടണ്ടസ്, ദഹനത്തിനും കാർമിനേറ്റീവ് ഗുണങ്ങൾക്കും പേരുകേട്ട ഒരു സസ്യമാണ്. ഇത് ദഹനക്കേട്, വയറുവേദന, വയറുവേദന എന്നിവ ഇല്ലാതാക്കാൻ സഹായിക്കുന്നു. മുസ്തയ്ക്ക് ആൻ്റിമൈക്രോബയൽ ഇഫക്റ്റുകളും ഉണ്ട്.",
        #         "treats": "ദഹനക്കേട്, വായുക്ഷോഭം, വയറുവേദന"
        #     },
        #     {
        #         "name": "വാസക",
        #         "description": "ശ്വാസകോശ സംബന്ധമായ അസുഖങ്ങളിൽ ഉപയോഗിക്കുന്ന ഒരു ഔഷധ സസ്യമാണ് വാസക, അല്ലെങ്കിൽ അഡത്തോട വാസിക. ഇത് ഒരു ബ്രോങ്കോഡിലേറ്ററായി പ്രവർത്തിക്കുന്നു, ചുമ, ആസ്ത്മ, ബ്രോങ്കൈറ്റിസ് എന്നിവ ഒഴിവാക്കാൻ സഹായിക്കുന്നു. വാസക്കയ്ക്ക് എക്സ്പെക്ടറൻ്റ്, ആൻറി-ഇൻഫ്ലമേറ്ററി ഇഫക്റ്റുകൾ ഉണ്ട്.",
        #         "treats": "ചുമ, ആസ്ത്മ, ബ്രോങ്കൈറ്റിസ്"
        #     },
        #     {
        #         "name": "കുട്ട്കി",
        #         "description": "കുത്കി, അല്ലെങ്കിൽ പിക്രോറിസ കുറോവ, കരൾ തകരാറുകൾക്കും രോഗപ്രതിരോധ ശേഷിക്കും ഉപയോഗിക്കുന്ന ഒരു കയ്പേറിയ സസ്യമാണ്. ഇത് പിത്തരസം ഉൽപാദനത്തെ ഉത്തേജിപ്പിക്കുന്നു, കരളിൻ്റെ പ്രവർത്തനം മെച്ചപ്പെടുത്തുന്നു, വിഷാംശം ഇല്ലാതാക്കാൻ സഹായിക്കുന്നു. കുത്കിക്ക് വിരുദ്ധ ബാഹ്യാവിഷ്ക്കാര ഗുണങ്ങളും ഉണ്ട്.",
        #         "treats": "കരൾ തകരാറുകൾ, മഞ്ഞപ്പിത്തം, രോഗപ്രതിരോധ പിന്തുണ"
        #     },
        #     {
        #         "name": "ഭൃംഗരാജ്",
        #         "description": "മുടിയെ പുനരുജ്ജീവിപ്പിക്കുന്ന ഗുണങ്ങൾക്ക് പേരുകേട്ട ഒരു സസ്യമാണ് ഭൃംഗരാജ് അല്ലെങ്കിൽ എക്ലിപ്റ്റ ആൽബ. ഇത് മുടിയുടെ വേരുകളെ ശക്തിപ്പെടുത്തുന്നു, മുടി കൊഴിച്ചിൽ തടയുന്നു, മുടി വളർച്ചയെ പ്രോത്സാഹിപ്പിക്കുന്നു. ഭൃംഗരാജിന് വിരുദ്ധ ബാഹ്യാവിഷ്ക്കാര ഫലങ്ങളും ഉണ്ട്.",
        #         "treats": "മുടികൊഴിച്ചിൽ, അകാല നര, തലയോട്ടിയിലെ അവസ്ഥ"
        #     },
        #     {
        #         "name": "യഷ്ടിമധു",
        #         "description": "വിവിധ ആയുർവേദ ഫോർമുലേഷനുകളിൽ ഉപയോഗിക്കുന്ന മധുരമുള്ള ഒരു ഔഷധസസ്യമാണ് യഷ്ടിമധു അഥവാ ലൈക്കോറൈസ്. ഇത് ദഹനവ്യവസ്ഥയെ ശമിപ്പിക്കുന്നു, ചുമയും തൊണ്ടവേദനയും ഒഴിവാക്കുന്നു, അഡ്രീനൽ പ്രവർത്തനത്തെ പിന്തുണയ്ക്കുന്നു. യഷ്ടിമധുവിന് ആൻറി-ഇൻഫ്ലമേറ്ററി, ഇമ്മ്യൂൺ-മോഡുലേറ്റിംഗ് ഇഫക്റ്റുകൾ ഉണ്ട്.",
        #         "treats": "ആസിഡ് റിഫ്ലക്സ്, ചുമ, അഡ്രീനൽ പിന്തുണ"
        #     }
    ]

    for med_data in ayurvedic_medicines:
        AyurvedicMedicine.objects.create(
            name=med_data['name'],
            description=med_data['description'],
            treats=med_data['treats']
        )